#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаполнитьТаблицуПроверкиМетодовМетодами();

	//Проверка добавления групп
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект);
	РедакторФорм.ДобавитьГруппуСКолонкамиЛевоИПраво(КонтекстФормы, "ОсновнаяГруппа");
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", 1);
	ОсновнаяГруппаЛево = Элементы.ОсновнаяГруппаЛево;
	ОсновнаяГруппаПраво = Элементы.ОсновнаяГруппаПраво;
	
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаЛево);
	РедакторФорм.ДобавитьГруппуСКолонкамиЛевоИПраво(КонтекстФормы, "ЛеваяПодгруппа");
	ЛеваяПодгруппаЛево = Элементы.ЛеваяПодгруппаЛево;
	ЛеваяПодгруппаПраво = Элементы.ЛеваяПодгруппаПраво;
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаЛево);
	ГруппаПодШапкойСлева = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаПодШапкойСлева");
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаЛево, , Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда));
	ГруппаКнопокСлева = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаКнопокСлева");
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаПраво, , Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда));
	ГруппаТаблицыПраво = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаТаблицыПраво");	
	ГруппаИтоговПраво = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаИтоговПраво");
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаПраво, ГруппаТаблицыПраво, Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда));
	ГруппаВерхПраво = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаВерхПраво");	
	КонтекстВерхПраво = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаВерхПраво);
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаЛево);	
	КонтекстФормы.Свойства = Новый Структура("Вид, Группировка, ОтображатьЗаголовок", ВидГруппыФормы.ОбычнаяГруппа, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно, Ложь);
	ЭлементГруппаБулево = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстФормы, "ГруппаБулево"); 
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", 1);

	#Область ЛеваяКолонка
	
	РедакторФорм.ДобавитьКомандуНаФорму(КонтекстФормы, "Подключаемый_КомандаКнопки1", "Подключаемый_КомандаКнопки1", "КомандаКнопки1");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 1);

	КонтекстГруппыБулево = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЭлементГруппаБулево);
	ЭлементРеквизитБулево = РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстГруппыБулево, "РеквизитБулево");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	
		
	КонтекстГруппыЛево = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЛеваяПодгруппаПраво);
	ЭлементРеквизитСтрока = РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстГруппыЛево, "РеквизитСтрока");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", , 1);	
	
	КонтекстФормы.Свойства = Новый Структура;
	КонтекстФормы.Свойства.Вставить("ПутьКДанным", "РеквизитДобавитьПолеНаФорму");
	КонтекстФормы.Родитель = ГруппаВерхПраво;
	РеквизитРеквизитДобавитьПолеНаФорму = РедакторФорм.ДобавитьПолеНаФорму(КонтекстФормы, "РеквизитДобавитьПолеНаФорму");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);
	
		
	РедакторФорм.ДобавитьПолеНаФормуРеквизитФормы(КонтекстВерхПраво, "РеквизитДобавитьПолеНаФормуРеквизитФормы");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитФормы", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	

	КонтекстГруппыЛево = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЛеваяПодгруппаЛево);
	РеквизитРеквизитДобавитьПолеНаФорму = РедакторФорм.ДобавитьПолеВШапкуФормыРеквизитОбъекта(КонтекстГруппыЛево, "РеквизитШапки");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеВШапкуФормыРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);	
	
	#КонецОбласти

	#Область ПраваяКолонка
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаВерхПраво);
	Кнопка2 = РедакторФорм.ДобавитьКомандуИГиперссылкуНаФорму(КонтекстФормы, "КомандаКнопки2", "Подключаемый_КомандаКнопки2", "КомандаКнопки2", Неопределено);
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИГиперссылкуНаФорму", 1);

	КонтекстГруппыПраво = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаТаблицыПраво);
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыИмяМетода", "ИмяМетода");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыВызвано", "Вызвано");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыПроверено", "Проверено");
	ЭлементТаблицаПроверряемыеМетоды = РедакторФорм.ДобавитьТаблицуНаФорму(КонтекстГруппыПраво, "ТаблицаПроверряемыеМетоды", "Объект.ПроверяемыеПроцедурыИФункции", СтруктураКолонок);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаПодШапкойСлева);
	КонтекстФормы.Родитель = ЭлементТаблицаПроверряемыеМетоды;
	КонтекстФормы.Свойства = Новый Структура;
	ЭлементТаблицаПроверряемыеМетодыУспех = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстФормы, "Объект.ПроверяемыеПроцедурыИФункции", "Успех");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеТабличнойЧастиНаформу", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);

	
	КонтекстПраво = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаИтоговПраво);

	ЭлементФлажок = РедакторФорм.ДобавитьПолеФлажкаНаФормуРеквизитОбъекта(КонтекстГруппыБулево, "Флажок");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	ЭлементФлажок = РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПраво, "ВсегоПроцедурИФункций");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	ЭлементФлажок = РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПраво, "ВсегоУспешных");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);
	
	КонтекстФормы.Родитель = ГруппаПодШапкойСлева;
	//КонтекстФормы.РасположитьПередЭлементом = РеквизитРеквизитДобавитьПолеНаФорму;
	ЭлементМногострочноеПоле = РедакторФорм.ДобавитьМногострочноеПолеРеквизитОбъекта(КонтекстФормы, "МногострочноеПоле");	
	ДобавитьКСчетчикуПоМетоду("ДобавитьМногострочноеПолеРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", , 1);
	
	КонтекстПанели = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель);
	ГруппаКнопок = РедакторФорм.ДобавитьГруппуКнопок(КонтекстПанели);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
		
	КонтекстГруппыКнопок = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаКнопокСлева);
	Кнопка = РедакторФорм.ДобавитьКнопкуНаФорму(КонтекстГруппыКнопок, "КнопкаКоманды1", ВидКнопкиФормы.ОбычнаяКнопка, "Подключаемый_КомандаКнопки1");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКнопкуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", , 1);
	
	//
		
	КонтекстФормы.Родитель = ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель;
	Кнопка3 = РедакторФорм.ДобавитьКомандуИКнопкуКоманднойПанели(КонтекстФормы, "КомандаКнопки3", "КомандаКнопки3");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуКоманднойПанели", 1);

	КонтекстПраво.Свойства = Новый Структура("Заголовок", "Подвести итог");
	Кнопка3 = РедакторФорм.ДобавитьКомандуИКнопкуНаФорму(КонтекстПраво, "КомандаКнопки4", "КомандаКнопки4");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуНаФорму", 1);		
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки1(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки2(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки3(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки4(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
	ОбновитьИтогУспешных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновнаяГруппа

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИтогУспешных()
	
	Объект.ВсегоУспешных = Объект.ПроверяемыеПроцедурыИФункции.Итог("Проверено");
	
КонецПроцедуры

Процедура ДобавитьКСчетчикуПоМетоду(ИмяМетода, Вызвано = 0, Проверено = 0)

	СтруктураПоиска = Новый Структура("ИмяМетода", ИмяМетода);
	СтрокиМетода = Объект.ПроверяемыеПроцедурыИФункции.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаМетода Из СтрокиМетода Цикл
		СтрокаМетода.Вызвано = СтрокаМетода.Вызвано + Вызвано;
		СтрокаМетода.Проверено = СтрокаМетода.Проверено + Проверено;
	КонецЦикла;

КонецПроцедуры

Процедура НаполнитьТаблицуПроверкиМетодовМетодами()
	
	МассивИменМетодов = Новый Массив;
	
	// ДобавлениеПолей
	МассивИменМетодов.Добавить("ДобавитьПолеНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитФормы");
	
	// ДобавлениеГрупп
	МассивИменМетодов.Добавить("ДобавитьГруппуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьГруппуСКолонкамиЛевоИПраво");

	// ДобавлениеТаблиц
	МассивИменМетодов.Добавить("ДобавитьТаблицуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеТабличнойЧастиНаформу");
	
	// ДобавлениеКоманд
	МассивИменМетодов.Добавить("ДобавитьКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИГиперссылкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуКоманднойПанели");	
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуНаФорму");
	
	// ДобавлениеРеквизитовОбъекта
	МассивИменМетодов.Добавить("ДобавитьРеквизитОбъектаНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеВШапкуФормыРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьМногострочноеПолеРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьГруппуКнопок");
	
	Для Каждого ИмяМетода Из МассивИменМетодов Цикл
		НоваяСтрока = Объект.ПроверяемыеПроцедурыИФункции.Добавить();
		НоваяСтрока.ИмяМетода = ИмяМетода;
	КонецЦикла;
	
	Объект.ВсегоПроцедурИФункций = Объект.ПроверяемыеПроцедурыИФункции.Количество();

КонецПроцедуры
	
#КонецОбласти
