#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаполнитьТаблицуПроверкиМетодовМетодами();

	#Область ДобавлениеСтраниц
	
	КонтекстСтраницы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, , , Новый Структура("Вид", ВидГруппыФормы.Страницы));
	ГруппаСтраницы = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстСтраницы, "ГруппаСтраницы");
	КонтекстСтраницы.Родитель = ГруппаСтраницы;
	КонтекстСтраницы.Свойства.Вид = ВидГруппыФормы.Страница;	
	
	КонтекстСтраницы.Свойства.Вставить("Заголовок", "Основная");
	ГруппаПерваяСтраница = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстСтраницы, "ПерваяСтраница");	
	КонтекстСтраницы.Свойства.Вставить("Заголовок", "Итоговая таблица");
	ГруппаВтораяСтраница = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстСтраницы, "ВтораяСтраница");
	
	#КонецОбласти
	
	#Область ДобавлениеГрупп
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаПерваяСтраница);
	РедакторФорм.ДобавитьГруппуСКолонкамиЛевоИПраво(КонтекстФормы, "ГруппаСтроковыхРеквизитов");
	ГруппаСтроковыхРеквизитовЛево = Элементы.ГруппаСтроковыхРеквизитовЛево;
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаСтроковыхРеквизитовЛево);
	РедакторФорм.ДобавитьГруппуСКолонкамиЛевоИПраво(КонтекстФормы, "ЛеваяПодгруппа");
	ЛеваяПодгруппаЛево = Элементы.ЛеваяПодгруппаЛево;
	ЛеваяПодгруппаПраво = Элементы.ЛеваяПодгруппаПраво;
	
	// Вторая страница
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаВтораяСтраница, , Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда));
	ГруппаИтоговойТаблицы = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаИтоговойТаблицы");
	ГруппаРеквизитовИтогов = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаРеквизитовИтогов");
	
	// Первая страница
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаПерваяСтраница);
	ГруппаМногострочноеПоле = РедакторФорм.ДобыавитьГруппуОбычную(КонтекстФормы, "ГруппаМногострочноеПоле");

	КонтекстФормы.Свойства.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	КонтекстФормы.Свойства.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	КонтекстФормы.Свойства.Вставить("ОтображатьЗаголовок", Ложь);							
	ГруппаБулево = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстФормы, "ГруппаБулево"); 
	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", 1);

	ЛеваяПодгруппаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	#КонецОбласти
	
	#Область СтраницаОсновная
	
	КонтекстКоманда2 = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЛеваяПодгруппаПраво);
	РедакторФорм.ДобавитьКомандуИГиперссылкуНаФорму(КонтекстКоманда2, "КомандаКнопки2", "Подключаемый_КомандаКнопки2", "Очистить все");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИГиперссылкуНаФорму", 1);

	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаМногострочноеПоле);
	РедакторФорм.ДобавитьМногострочноеПолеРеквизитОбъекта(КонтекстФормы, "МногострочноеПоле");	
	ДобавитьКСчетчикуПоМетоду("ДобавитьМногострочноеПолеРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", , 1);

	КонтекстГруппыЛево = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЛеваяПодгруппаЛево);
	РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстГруппыЛево, "РеквизитСтрока");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", , 1);	

	РедакторФорм.ДобавитьПолеНаФормуРеквизитФормы(КонтекстГруппыЛево, "РеквизитДобавитьПолеНаФормуРеквизитФормы");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитФормы", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	

	КонтекстГруппыЛево = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЛеваяПодгруппаЛево);
	РедакторФорм.ДобавитьПолеВШапкуФормыРеквизитОбъекта(КонтекстГруппыЛево, "РеквизитШапки");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеВШапкуФормыРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);
		
	КонтекстФормыПоле = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЛеваяПодгруппаЛево);	
	КонтекстФормыПоле.Свойства = Новый Структура;
	КонтекстФормыПоле.Свойства.Вставить("ПутьКДанным", "РеквизитДобавитьПолеНаФорму");
	РедакторФорм.ДобавитьПолеНаФорму(КонтекстФормыПоле, "РеквизитДобавитьПолеНаФорму");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);	
	
	КонтекстГруппыБулево = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаБулево);
	РедакторФорм.ДобавитьПолеФлажкаНаФормуРеквизитОбъекта(КонтекстГруппыБулево, "Флажок");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	

	РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстГруппыБулево, "РеквизитБулево");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);
	
	КонтекстКоманда = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаБулево);	
	РедакторФорм.ДобавитьКомандуНаФорму(КонтекстКоманда, "Подключаемый_КомандаКнопки1", "Подключаемый_КомандаКнопки1", "Информация");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 1);
				
	КонтекстГруппыКнопок = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаБулево);
	РедакторФорм.ДобавитьКнопкуНаФорму(КонтекстГруппыКнопок, "КнопкаКоманды1", ВидКнопкиФормы.ОбычнаяКнопка, "Подключаемый_КомандаКнопки1");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКнопкуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", , 1);

	#КонецОбласти
			
	#Область СтраницаИтоговая	

	КонтекстГруппаИтоговойТаблицы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаИтоговойТаблицы);
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыИмяМетода", "ИмяМетода");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыВызвано", "Вызвано");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыПроверено", "Проверено");
	ЭлементТаблицаПроверряемыеМетоды = РедакторФорм.ДобавитьТаблицуНаФорму(КонтекстГруппаИтоговойТаблицы, "ТаблицаПроверряемыеМетоды", "Объект.ПроверяемыеПроцедурыИФункции", СтруктураКолонок);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	
	КонтекстФормы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаМногострочноеПоле);
	КонтекстФормы.Родитель = ЭлементТаблицаПроверряемыеМетоды;
	КонтекстФормы.Свойства = Новый Структура;
	РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстФормы, "Объект.ПроверяемыеПроцедурыИФункции", "Успех");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеТабличнойЧастиНаформу", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
	
	КонтекстПанели = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель);
	РедакторФорм.ДобавитьГруппуКнопок(КонтекстПанели);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
	
	КонтекстФормы.Родитель = ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель;
	РедакторФорм.ДобавитьКомандуИКнопкуКоманднойПанели(КонтекстФормы, "КомандаКнопки3", "Обновить");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуКоманднойПанели", 1);

	КонтекстПраво = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитовИтогов);
	РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПраво, "ВсегоПроцедурИФункций");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПраво, "ВсегоУспешных");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	КонтекстПраво.Свойства = Новый Структура("Заголовок", "Подвести итог");
	едакторФорм.ДобавитьКомандуИКнопкуНаФорму(КонтекстПраво, "КомандаКнопки4", "КомандаКнопки4");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуНаФорму", 1);	
				
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки1(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки2(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки3(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки4(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
	ОбновитьИтогУспешных();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИтогУспешных()
	
	Объект.ВсегоУспешных = Объект.ПроверяемыеПроцедурыИФункции.Итог("Проверено");
	
КонецПроцедуры

Процедура ДобавитьКСчетчикуПоМетоду(ИмяМетода, Вызвано = 0, Проверено = 0)

	СтруктураПоиска = Новый Структура("ИмяМетода", ИмяМетода);
	СтрокиМетода = Объект.ПроверяемыеПроцедурыИФункции.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаМетода Из СтрокиМетода Цикл
		СтрокаМетода.Вызвано = СтрокаМетода.Вызвано + Вызвано;
		СтрокаМетода.Проверено = СтрокаМетода.Проверено + Проверено;
	КонецЦикла;

КонецПроцедуры

Процедура НаполнитьТаблицуПроверкиМетодовМетодами()
	
	МассивИменМетодов = Новый Массив;
	
	// ДобавлениеПолей
	МассивИменМетодов.Добавить("ДобавитьПолеНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитФормы");
	
	// ДобавлениеГрупп
	МассивИменМетодов.Добавить("ДобавитьГруппуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьГруппуСКолонкамиЛевоИПраво");

	// ДобавлениеТаблиц
	МассивИменМетодов.Добавить("ДобавитьТаблицуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеТабличнойЧастиНаформу");
	
	// ДобавлениеКоманд
	МассивИменМетодов.Добавить("ДобавитьКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИГиперссылкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуКоманднойПанели");	
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуНаФорму");
	
	// ДобавлениеРеквизитовОбъекта
	МассивИменМетодов.Добавить("ДобавитьРеквизитОбъектаНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеВШапкуФормыРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьМногострочноеПолеРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьГруппуКнопок");
	
	Для Каждого ИмяМетода Из МассивИменМетодов Цикл
		НоваяСтрока = Объект.ПроверяемыеПроцедурыИФункции.Добавить();
		НоваяСтрока.ИмяМетода = ИмяМетода;
	КонецЦикла;
	
	Объект.ВсегоПроцедурИФункций = Объект.ПроверяемыеПроцедурыИФункции.Количество();

КонецПроцедуры
	
#КонецОбласти
