#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаполнитьТаблицуПроверкиМетодовМетодами();

	//Проверка добавления групп
	КонтекстФормы = ккПодготовкаФорм.СоздатьКонтекстЭлемента(ЭтотОбъект);
	ккПодготовкаФорм.ДобавитьГруппуСКолонкамиЛевоИПраво(КонтекстФормы, "ОсновнаяГруппа");
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", 1);
	ОсновнаяГруппаЛево = Элементы.ОсновнаяГруппаЛево;
	ОсновнаяГруппаПраво = Элементы.ОсновнаяГруппаПраво;
	
	КонтекстФормы.Свойства = Новый Структура("Вид, Группировка, ОтображатьЗаголовок", ВидГруппыФормы.ОбычнаяГруппа, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно, Ложь);
	ЭлементГруппаБулево = ккПодготовкаФорм.ДобавитьГруппуНаФорму(КонтекстФормы, "ГруппаБулево"); 
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", 1);

	//Левая колонка
	
	ккПодготовкаФорм.ДобавитьКомандуНаФорму(КонтекстФормы, "Подключаемый_КомандаКнопки1", "Подключаемый_КомандаКнопки1", "КомандаКнопки1");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 1);

	КонтекстГруппыБулево = ккПодготовкаФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЭлементГруппаБулево);
	ЭлементРеквизитБулево = ккПодготовкаФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстГруппыБулево, "РеквизитБулево");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	
		
	КонтекстГруппыЛево = ккПодготовкаФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаЛево, ЭлементРеквизитБулево);
	ЭлементРеквизитСтрока = ккПодготовкаФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстГруппыЛево, "РеквизитСтрока");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", , 1);	
	
	КонтекстФормы.Свойства = Новый Структура;
	КонтекстФормы.Свойства.Вставить("ПутьКДанным", "РеквизитДобавитьПолеНаФорму");
	РеквизитРеквизитДобавитьПолеНаФорму = ккПодготовкаФорм.ДобавитьПолеНаФорму(КонтекстГруппыЛево, "РеквизитДобавитьПолеНаФорму");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);	

	РеквизитРеквизитДобавитьПолеНаФорму = ккПодготовкаФорм.ДобавитьПолеВШапкуФормыРеквизитОбъекта(КонтекстГруппыЛево, "РеквизитШапки");		
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеВШапкуФормыРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитОбъекта", , 1);	

	//Правая колонка
	КонтекстГруппыПраво = ккПодготовкаФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ОсновнаяГруппаПраво);
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыИмяМетода", "ИмяМетода");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыВызвано", "Вызвано");
	СтруктураКолонок.Вставить("ТаблицаПроверряемыеМетодыПроверено", "Проверено");
	ЭлементТаблицаПроверряемыеМетоды = ккПодготовкаФорм.ДобавитьТаблицуНаФорму(КонтекстГруппыПраво, "ТаблицаПроверряемыеМетоды", "Объект.ПроверяемыеПроцедурыИФункции", СтруктураКолонок);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуСКолонкамиЛевоИПраво", , 1);	
	
	КонтекстФормы.Родитель = ЭлементТаблицаПроверряемыеМетоды;
	КонтекстФормы.Свойства = Новый Структура;
	ЭлементТаблицаПроверряемыеМетодыУспех = ккПодготовкаФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстФормы, "Объект.ПроверяемыеПроцедурыИФункции", "Успех");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеТабличнойЧастиНаформу", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
		
	ккПодготовкаФорм.ДобавитьПолеНаФормуРеквизитФормы(КонтекстГруппыБулево, "РеквизитДобавитьПолеНаФормуРеквизитФормы");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФормуРеквизитФормы", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);	
	
	ЭлементФлажок = ккПодготовкаФорм.ДобавитьПолеФлажкаНаФормуРеквизитОбъекта(КонтекстГруппыБулево, "Флажок");
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	ЭлементФлажок = ккПодготовкаФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстГруппыБулево, "ВсегоПроцедурИФункций");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);

	ЭлементФлажок = ккПодготовкаФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстГруппыБулево, "ВсегоУспешных");
	ДобавитьКСчетчикуПоМетоду("ДобавитьРеквизитОбъектаНаФорму", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуНаФорму", , 1);
	
	КонтекстФормы.Родитель = ОсновнаяГруппаЛево;
	КонтекстФормы.РасположитьПередЭлементом = РеквизитРеквизитДобавитьПолеНаФорму;
	ЭлементМногострочноеПоле = ккПодготовкаФорм.ДобавитьМногострочноеПолеРеквизитОбъекта(КонтекстФормы, "МногострочноеПоле");	
	ДобавитьКСчетчикуПоМетоду("ДобавитьМногострочноеПолеРеквизитОбъекта", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьПолеНаФорму", , 1);
	
	КонтекстПанели = ккПодготовкаФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель);
	ГруппаКнопок = ккПодготовкаФорм.ДобавитьГруппуКнопок(КонтекстПанели);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", 1);	
	ДобавитьКСчетчикуПоМетоду("ДобавитьТаблицуНаФорму", , 1);
		
	КонтекстГруппыКнопок = ккПодготовкаФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаКнопок);
	Кнопка = ккПодготовкаФорм.ДобавитьКнопкуНаФорму(КонтекстФормы, "КнопкаКоманды1", ВидКнопкиФормы.ОбычнаяКнопка, "Подключаемый_КомандаКнопки1");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКнопкуНаФорму", 1);
	ДобавитьКСчетчикуПоМетоду("ДобавитьГруппуКнопок", , 1);
	
	//
	Кнопка2 = ккПодготовкаФорм.ДобавитьКомандуИГиперссылкуНаФорму(КонтекстФормы, "КомандаКнопки2", "Подключаемый_КомандаКнопки2", "КомандаКнопки2", ОсновнаяГруппаЛево);
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИГиперссылкуНаФорму", 1);
		
	КонтекстФормы.Родитель = ЭлементТаблицаПроверряемыеМетоды.КоманднаяПанель;
	Кнопка3 = ккПодготовкаФорм.ДобавитьКомандуИКнопкуКоманднойПанели(КонтекстФормы, "КомандаКнопки3", "КомандаКнопки3");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуКоманднойПанели", 1);

	КонтекстФормы.Родитель = ОсновнаяГруппаЛево;	
	КонтекстФормы.Свойства = Новый Структура("Заголовок", "Подвести итог");
	Кнопка3 = ккПодготовкаФорм.ДобавитьКомандуИКнопкуНаФорму(КонтекстФормы, "КомандаКнопки4", "КомандаКнопки4");
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуИКнопкуНаФорму", 1);		
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки1(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки2(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки3(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаКнопки4(Команда)
	ДобавитьКСчетчикуПоМетоду("ДобавитьКомандуНаФорму", 0, 1);
	ОбновитьИтогУспешных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновнаяГруппа

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИтогУспешных()
	
	Объект.ВсегоУспешных = Объект.ПроверяемыеПроцедурыИФункции.Итог("Проверено");
	
КонецПроцедуры

Процедура ДобавитьКСчетчикуПоМетоду(ИмяМетода, Вызвано = 0, Проверено = 0)

	СтруктураПоиска = Новый Структура("ИмяМетода", ИмяМетода);
	СтрокиМетода = Объект.ПроверяемыеПроцедурыИФункции.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаМетода Из СтрокиМетода Цикл
		СтрокаМетода.Вызвано = СтрокаМетода.Вызвано + Вызвано;
		СтрокаМетода.Проверено = СтрокаМетода.Проверено + Проверено;
	КонецЦикла;

КонецПроцедуры

Процедура НаполнитьТаблицуПроверкиМетодовМетодами()
	
	МассивИменМетодов = Новый Массив;
	
	// ДобавлениеПолей
	МассивИменМетодов.Добавить("ДобавитьПолеНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитФормы");
	
	// ДобавлениеГрупп
	МассивИменМетодов.Добавить("ДобавитьГруппуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьГруппуСКолонкамиЛевоИПраво");

	// ДобавлениеТаблиц
	МассивИменМетодов.Добавить("ДобавитьТаблицуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеТабличнойЧастиНаформу");
	
	// ДобавлениеКоманд
	МассивИменМетодов.Добавить("ДобавитьКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИГиперссылкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуКоманднойПанели");	
	МассивИменМетодов.Добавить("ДобавитьКомандуИКнопкуНаФорму");
	МассивИменМетодов.Добавить("ДобавитьКомандуНаФорму");
	
	// ДобавлениеРеквизитовОбъекта
	МассивИменМетодов.Добавить("ДобавитьРеквизитОбъектаНаФорму");
	МассивИменМетодов.Добавить("ДобавитьПолеНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеВШапкуФормыРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьМногострочноеПолеРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьПолеФлажкаНаФормуРеквизитОбъекта");
	МассивИменМетодов.Добавить("ДобавитьГруппуКнопок");
	
	Для Каждого ИмяМетода Из МассивИменМетодов Цикл
		НоваяСтрока = Объект.ПроверяемыеПроцедурыИФункции.Добавить();
		НоваяСтрока.ИмяМетода = ИмяМетода;
	КонецЦикла;
	
	Объект.ВсегоПроцедурИФункций = Объект.ПроверяемыеПроцедурыИФункции.Количество();

КонецПроцедуры
	
#КонецОбласти
